# Print -  Варианты выполнения кода, функции (sep=', ') и ( end='\n')

print("1 + 2 =", 1 + 2)  # 1 + 2 = 3
print("3 ** 2 =", 3 ** 2)  # 3 ** 2 = 9
print("5 * 6 =", 5 * 6)  # 5 * 6 = 30
x = 5
print(x)  # 5
a = [1, 2, 3, 4, 5, 6]
print(a)  # (1, 2, 3, 4, 5, 6)
print('Мама варит вкусную кашу!')  # Мама варит вкусную кашу!

print('a', 'b', 'c', 'd', 125) # a b c d 125
print('a', 'b', 'c', 'd', 125, sep='') # abcd125
print('a', 'b', 'c', 'd', 125, sep='/ ') # a/ b/ c/ d/ 125
print('a', 'b', 'c', 'd', 125, sep=' * ', end='!') # a * b * c * d * 125!
print() # По умолчанию стоит ( end='\n') -перенос на другую строку.
print('a', 'b', 'c', 'd', 125, sep='-', end='  /') # a-b-c-d-125  /a b c d 125
print('a', 'b', 'c', 'd', 125) # распечатан в предыдущем принте
print(1, 2, 3, sep='\n') # 1
                         # 2
                         # 3
